app/controllers/agents_controller.rb

SELECT `agents`.* FROM `agents`
---
  def index
    @agents = Agent.all