app/controllers/postman_controller.rb

SELECT `templates`.* FROM `templates` WHERE `templates`.`identifier` = 'variant' LIMIT 1
---
  def deliver
    Services::Slog.debug({:message => "Starting delivery for #{params[:identifier]}", :module => "Postman", :task => "deliver", :extra => {:template => params[:identifier]}})

    @delivery
    begin
      @template = Template.find_by! identifier: params[:identifier]

SELECT COUNT(*) FROM `templates` WHERE `templates`.`identifier` = 'pinger' AND `templates`.`publisher` IS NULL
INSERT INTO `templates` (`created_at`, `help`, `identifier`, `payload`, `publisher`, `title`, `updated_at`, `variables`) VALUES ('2013-10-02 10:27:48', 'Load variome metadata for new variants in database', 'variant', '---\n:host: localhost\n:username: root\n:password: telematica\n:database: i2x\n:query: INSERT INTO stds(label, help, visited, created_at, updated_at) VALUES(\'variant\',\n \'%{refseq}:%{variant}\', %{id}, now(), now());\n', 'sql', 'variant', '2013-10-02 10:27:48', '---\n- id\n- variant\n- refseq\n')
---
  def load
    begin
      @t = Template.where(identifier: params[:identifier], publisher: params[:publisher])
      if @t.count > 0 then
        response = { :status => "402", :message => "[i2x]: template #{params[:identifier]} already exists"}
      else
        attrs = JSON.parse(IO.read("templates/#{params[:publisher]}/#{params[:identifier]}.js"))
        t = Template.create! attrs

SELECT `templates`.* FROM `templates` WHERE `templates`.`identifier` = 'variant' LIMIT 1
---
  def go
    @host = Services::Helper.hostname
    @date = Services::Helper.date
    @time = Services::Helper.datetime

    t = Template.find_by identifier: params[:identifier]