app/controllers/stds_controller.rb

SELECT `stds`.* FROM `stds`
---
  def index
    @stds = Std.all