app/controllers/templates_controller.rb

SELECT `templates`.* FROM `templates`
---
  def index
    @templates = Template.all

INSERT INTO `templates` (`created_at`, `help`, `identifier`, `memory`, `payload`, `publisher`, `title`, `updated_at`, `variables`) VALUES ('2013-10-11 08:50:28', 'Dump content to file', 'dump', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nmethod: append\nuri: file:///Users/pedrolopes/Temp/i2log.csv\ncontent: |\n %{i2x.date},%{id}\n', 'file', 'Dump', '2013-10-11 08:50:28', '---\n- id\n')
---
  def new

    @template = Template.new
    if request.post? then
      puts params[:message]
      attrs = JSON.parse(params[:message])
      @template = Template.create! attrs

INSERT INTO `templates` (`count`, `created_at`, `help`, `identifier`, `last_execute_at`, `memory`, `payload`, `publisher`, `title`, `updated_at`, `variables`) VALUES (0, '2013-10-02 11:00:00', 'Ping server and save on log file', 'pinger', '2013-10-02 11:00:00', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', 'url', 'pinger', '2013-10-02 11:00:00', '[\"id\"]')
---
  def create
    @template = Template.new(template_params)
    respond_to do |format|
      if @template.save

UPDATE `templates` SET `identifier` = 'this', `title` = 'that', `help` = 'this and that', `variables` = '--- \'[\"lol\",\"lo2\"]\'\n', `payload` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', `memory` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', `count` = 0, `last_execute_at` = '2013-10-02 13:27:00', `created_at` = '2013-10-02 13:27:00', `updated_at` = '2013-10-02 13:27:00' WHERE `templates`.`id` = 13
---
  def update
    respond_to do |format|
      if @template.update(template_params)

DELETE FROM `templates` WHERE `templates`.`id` = 3
---
  def destroy
    @template.destroy

INSERT INTO `templates` (`created_at`, `help`, `identifier`, `memory`, `payload`, `publisher`, `title`, `updated_at`, `variables`) VALUES ('2013-10-02 13:58:52', 'Load variome metadata for new variants in database', 'variant', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess\nhost: localhost\nusername: root\npassword: telematica\ndatabase: i2x\nquery: INSERT INTO stds(label, help, visited, created_at, updated_at) VALUES(\'variant\',\n \'%{refseq}:%{variant}\', %{id}, now(), now());\n', 'sql', 'variant', '2013-10-02 13:58:52', '---\n- id\n- variant\n- refseq\n')
---
  def start
    @template = Template.new
    if request.post? then
      puts params[:message]
      attrs = JSON.parse(params[:message])
      @template = Template.create! attrs

SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 6 LIMIT 1
---
    def set_template
      @template = Template.find(params[:id])