app/controllers/templates_controller.rb

  def create
    @template = Template.new(template_params)
    @template.last_execute_at = nil
    @template.status = 100
    @template.count = 0
    respond_to do |format|
      if @template.save
        current_user.templates.push(@template)
        current_user.save
---
UPDATE `templates` SET `updated_at` = '2013-10-02 13:43:42', `variables` = '--- as\n...\n', `payload` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n', `memory` = '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess {}\n' WHERE `templates`.`id` = 16