app/controllers/variants_controller.rb

  def index
    @variants = Variant.all
---
SELECT `variants`.* FROM `variants`

  def create
    @variant = Variant.new(variant_params)

    respond_to do |format|
      if @variant.save
---
INSERT INTO `variants` (`created_at`, `gene`, `refseq`, `updated_at`, `url`, `variant`) VALUES ('2013-09-27 10:06:23', 'COL3A1', 'NM_000090.3', '2013-09-27 10:06:23', 'https://eds.gene.le.ac.uk/variants.php?select_db=COL3A1&action=search_all&search_Variant/DNA=c.980G%3EA', 'c.980G>A')

    def set_variant
      @variant = Variant.find(params[:id])
---
SELECT `variants`.* FROM `variants` WHERE `variants`.`id` = 1 LIMIT 1